In [3]:
import warnings
warnings.filterwarnings(action='ignore', category=FutureWarning)

In [4]:
import os
from datetime import datetime
from pathlib import Path

import pandas as pd
import numpy as np

import dask
from dask import dataframe as dd
from dask import array as da

data_path = Path(os.getcwd()).parent/"data"

In [3]:
parquet_path = data_path/"repartition_wp_w_div.parquet"

read_ddf = dd.read_parquet(parquet_path)
print(f"Division know : {read_ddf.known_divisions}, number of partition : {read_ddf.npartitions}")

Division know : False, number of partition : 55

### Create sample data for code testing

In [164]:
sample_ddf = \
(read_ddf
 .query("User in (0, 1, 2)")
 .groupby("User")
 .apply(lambda x: x.iloc[0:5])
 .reset_index(drop=True)
 .astype({"Year":"string"})
)
# sample_ddf.compute()
sample_ddf.to_parquet(data_path/"sample.parquet", write_index=False)

**!!IMPORTANT!!** to `order by` have to `sort_values` the dataframe before .groupby()

`Categorical` datatype will interfere the Aggregation, even not in the .groupby, better cast to `string`

In [4]:
sample_ddf = dd.read_parquet(data_path/"sample.parquet")[["Year", "dt", "User", "amount"]]
sample_ddf.compute()

   Year                  dt  User  amount
0  2007 2007-07-06 23:53:00     2    1.73
1  2007 2007-07-06 16:35:00     2   16.42
2  2007 2007-07-06 09:40:00     2   44.90
3  2007 2007-07-06 04:36:00     2   35.59
4  2007 2007-07-05 14:54:00     2  118.64
0  2007 2007-03-31 06:02:00     0   33.10
1  2007 2007-03-29 09:43:00     0  176.53
2  2007 2007-03-29 06:00:00     0  114.56
3  2007 2007-03-29 05:45:00     0  117.62
4  2007 2007-03-27 16:22:00     0  110.43
0  2007 2007-12-14 06:47:00     1   15.26
1  2007 2007-12-09 19:49:00     1   62.18
2  2007 2007-12-09 06:36:00     1   17.40
3  2007 2007-12-07 14:42:00     1   21.52
4  2007 2007-12-06 22:18:00     1   80.00

`.groupby().first()` = First row of each group

In [178]:
first_of_each_group = (sample_ddf
 .sort_values("dt", ascending = True)
 .groupby(["User"])
 .first()
 )
first_of_each_group.compute()

      Year                  dt  amount
User
0     2007 2007-03-27 16:22:00  110.43
2     2007 2007-07-05 14:54:00  118.64
1     2007 2007-12-06 22:18:00   80.00

In [179]:
sample_ddf.query("User == 0").sort_values("dt").compute().head(1)

   Year                  dt  User  amount
4  2007 2007-03-27 16:22:00     0  110.43

In [180]:
sample_ddf.query("User == 1").sort_values("dt").compute().head(1)

   Year                  dt  User  amount
4  2007 2007-12-06 22:18:00     1    80.0

`.groupby().last()` for last row in the group

In [181]:
(sample_ddf
 .sort_values("dt", ascending = True)
 .groupby(["User"])
 .last()
 ).compute()

      Year                  dt  amount
User
0     2007 2007-03-31 06:02:00   33.10
2     2007 2007-07-06 23:53:00    1.73
1     2007 2007-12-14 06:47:00   15.26

In [182]:
sample_ddf.query("User == 0").sort_values("dt").compute().tail(1)

   Year                  dt  User  amount
0  2007 2007-03-31 06:02:00     0    33.1

## Lead , Lag function
**IMPORTANT!! sort data first before lag / lead**

In [187]:
(sample_ddf
 .sort_values(["User", "dt"], ascending=[True, True])
 .assign(lagged_amount = lambda x : x["amount"].shift(1))
 .assign(ledded_amount = lambda x : x["amount"].shift(-1))
).compute()

   Year                  dt  User  amount  lagged_amount  ledded_amount
4  2007 2007-03-27 16:22:00     0  110.43            NaN         117.62
3  2007 2007-03-29 05:45:00     0  117.62         110.43         114.56
2  2007 2007-03-29 06:00:00     0  114.56         117.62         176.53
1  2007 2007-03-29 09:43:00     0  176.53         114.56          33.10
0  2007 2007-03-31 06:02:00     0   33.10         176.53          80.00
4  2007 2007-12-06 22:18:00     1   80.00          33.10          21.52
3  2007 2007-12-07 14:42:00     1   21.52          80.00          17.40
2  2007 2007-12-09 06:36:00     1   17.40          21.52          62.18
1  2007 2007-12-09 19:49:00     1   62.18          17.40          15.26
0  2007 2007-12-14 06:47:00     1   15.26          62.18         118.64
4  2007 2007-07-05 14:54:00     2  118.64          15.26          35.59
3  2007 2007-07-06 04:36:00     2   35.59         118.64          44.90
2  2007 2007-07-06 09:40:00     2   44.90          35.59          16.42
1  2007 2007-07-06 16:35:00     2   16.42          44.90           1.73
0  2007 2007-07-06 23:53:00     2    1.73          16.42            NaN

## Lead , Lag with Partition
Currenly Dask support partly window function with partition.  
**Better use Pandas for this task**

In [185]:
# Pandas style
pdf = sample_ddf.compute()
(pdf
 .sort_values(["User", "dt"], ascending=True)
 .assign(by_usr_lag_amt = lambda x : x.groupby("User")["amount"].shift(1))
 .assign(by_usr_led_amt = lambda x : x.groupby("User")["amount"].shift(-1))
)

   Year                  dt  User  amount  by_usr_lag_amt  by_usr_led_amt
4  2007 2007-03-27 16:22:00     0  110.43             NaN          117.62
3  2007 2007-03-29 05:45:00     0  117.62          110.43          114.56
2  2007 2007-03-29 06:00:00     0  114.56          117.62          176.53
1  2007 2007-03-29 09:43:00     0  176.53          114.56           33.10
0  2007 2007-03-31 06:02:00     0   33.10          176.53             NaN
4  2007 2007-12-06 22:18:00     1   80.00             NaN           21.52
3  2007 2007-12-07 14:42:00     1   21.52           80.00           17.40
2  2007 2007-12-09 06:36:00     1   17.40           21.52           62.18
1  2007 2007-12-09 19:49:00     1   62.18           17.40           15.26
0  2007 2007-12-14 06:47:00     1   15.26           62.18             NaN
4  2007 2007-07-05 14:54:00     2  118.64             NaN           35.59
3  2007 2007-07-06 04:36:00     2   35.59          118.64           44.90
2  2007 2007-07-06 09:40:00     2   44.90           35.59           16.42
1  2007 2007-07-06 16:35:00     2   16.42           44.90            1.73
0  2007 2007-07-06 23:53:00     2    1.73           16.42             NaN

In [ ]:
# Pandas style, NOT APPLICABLE with Dask Dataframe
(sample_ddf
 .sort_values(["User", "dt"], ascending=True)
 .assign(by_usr_lag_amt = lambda x : x.groupby("User")["amount"].shift(1))
 .assign(by_usr_led_amt = lambda x : x.groupby("User")["amount"].shift(-1))
)#.compute() will error

**Dask Series**, have SeriesGroupby that could do the partition lag/lead with `.groupby()[].apply(lambda x : x.shift()`

Note, with `.apply()` have to specifiy keyward `meta`=(column name:data type)

In [188]:
sorted_ddf = sample_ddf.sort_values(["User", "dt"], ascending=True)
lag_amt = sorted_ddf.groupby("User")["amount"].apply(lambda x: x.shift(1), meta=("lag_amt","float"))
lag_series = lag_amt.compute()

In [189]:
lag_series.reset_index().query("User == 0").head()

   User  level_1  lag_amt
5     0        4      NaN
6     0        3   110.43
7     0        2   117.62
8     0        1   114.56
9     0        0   176.53

In [190]:
sorted_ddf.query("User == 0").compute().head()

   Year                  dt  User  amount
4  2007 2007-03-27 16:22:00     0  110.43
3  2007 2007-03-29 05:45:00     0  117.62
2  2007 2007-03-29 06:00:00     0  114.56
1  2007 2007-03-29 09:43:00     0  176.53
0  2007 2007-03-31 06:02:00     0   33.10

In [191]:
# Exploring on transform, not Done
(sample_ddf
 .sort_values(["User", "dt"], ascending=True)
 .groupby("User")
 [["amount"]]
 .transform(lambda x : x.shift(1))
).compute().reset_index()

    index  amount
0       4     NaN
1       3  118.64
2       2   35.59
3       1   44.90
4       0   16.42
5       4     NaN
6       3  110.43
7       2  117.62
8       1  114.56
9       0  176.53
10      4     NaN
11      3   80.00
12      2   21.52
13      1   17.40
14      0   62.18

## Window Aggregate 
2 types of windows aggregate    
A) Without Partition  
B) With Partition  

with row position parameter like
- Rows between
- Unbound precedingm
- Unbound following

In [6]:
sample_ddf = dd.read_parquet(data_path/"sample.parquet")[["Year", "dt", "User", "amount"]]
pdf = sample_ddf.compute()

In [7]:
display(pdf.sort_values(["User", "dt"], ascending=[True, True]))

   Year                  dt  User  amount
4  2007 2007-03-27 16:22:00     0  110.43
3  2007 2007-03-29 05:45:00     0  117.62
2  2007 2007-03-29 06:00:00     0  114.56
1  2007 2007-03-29 09:43:00     0  176.53
0  2007 2007-03-31 06:02:00     0   33.10
4  2007 2007-12-06 22:18:00     1   80.00
3  2007 2007-12-07 14:42:00     1   21.52
2  2007 2007-12-09 06:36:00     1   17.40
1  2007 2007-12-09 19:49:00     1   62.18
0  2007 2007-12-14 06:47:00     1   15.26
4  2007 2007-07-05 14:54:00     2  118.64
3  2007 2007-07-06 04:36:00     2   35.59
2  2007 2007-07-06 09:40:00     2   44.90
1  2007 2007-07-06 16:35:00     2   16.42
0  2007 2007-07-06 23:53:00     2    1.73

**SQL equivalant**

```sql
select *
, sum(amount) over (order by dt asc 
                    rows between 2 preceding and current row) as rolling3_sum
from sample_ddf
```

#### Pandas

In [21]:
# Pandas - result same as SQL
(pdf
 .sort_values(["User", "dt"], ascending=True)
 .assign(rolling3_sum = lambda x : x["amount"].rolling(window=3, min_periods=1).sum().reset_index(drop=True).values)
)

   Year                  dt  User  amount  rolling3_sum
4  2007 2007-03-27 16:22:00     0  110.43        110.43
3  2007 2007-03-29 05:45:00     0  117.62        228.05
2  2007 2007-03-29 06:00:00     0  114.56        342.61
1  2007 2007-03-29 09:43:00     0  176.53        408.71
0  2007 2007-03-31 06:02:00     0   33.10        324.19
4  2007 2007-12-06 22:18:00     1   80.00        289.63
3  2007 2007-12-07 14:42:00     1   21.52        134.62
2  2007 2007-12-09 06:36:00     1   17.40        118.92
1  2007 2007-12-09 19:49:00     1   62.18        101.10
0  2007 2007-12-14 06:47:00     1   15.26         94.84
4  2007 2007-07-05 14:54:00     2  118.64        196.08
3  2007 2007-07-06 04:36:00     2   35.59        169.49
2  2007 2007-07-06 09:40:00     2   44.90        199.13
1  2007 2007-07-06 16:35:00     2   16.42         96.91
0  2007 2007-07-06 23:53:00     2    1.73         63.05

In [185]:
# Pandas - without out min_period=1, Pandas will give NaN for row with not enough data to calculate windos
(pdf
 .assign(rolling3_sum = lambda x : x["amount"].rolling(window=3).sum().reset_index(drop=True).values)
)

   Year                  dt  User  amount  rolling3_sum
0  2007 2007-07-06 23:53:00     2    1.73           NaN
1  2007 2007-07-06 16:35:00     2   16.42           NaN
2  2007 2007-07-06 09:40:00     2   44.90         63.05
3  2007 2007-07-06 04:36:00     2   35.59         96.91
4  2007 2007-07-05 14:54:00     2  118.64        199.13
0  2007 2007-03-31 06:02:00     0   33.10        187.33
1  2007 2007-03-29 09:43:00     0  176.53        328.27
2  2007 2007-03-29 06:00:00     0  114.56        324.19
3  2007 2007-03-29 05:45:00     0  117.62        408.71
4  2007 2007-03-27 16:22:00     0  110.43        342.61
0  2007 2007-12-14 06:47:00     1   15.26        243.31
1  2007 2007-12-09 19:49:00     1   62.18        187.87
2  2007 2007-12-09 06:36:00     1   17.40         94.84
3  2007 2007-12-07 14:42:00     1   21.52        101.10
4  2007 2007-12-06 22:18:00     1   80.00        118.92

### Pandas - time aware window aggregate
**Pandas need to `set_index(datetime).sort_index()` before this operation

**SQL equivalant**
```sql
select *
, sum(amount) over (order by dt asc 
                    range between 3 days preceding and current row) as roll3d_sum
from sample_ddf
```

In [218]:
pdf.set_index("dt").sort_index()

                     Year  User  amount
dt
2007-03-27 16:22:00  2007     0  110.43
2007-03-29 05:45:00  2007     0  117.62
2007-03-29 06:00:00  2007     0  114.56
2007-03-29 09:43:00  2007     0  176.53
2007-03-31 06:02:00  2007     0   33.10
2007-07-05 14:54:00  2007     2  118.64
2007-07-06 04:36:00  2007     2   35.59
2007-07-06 09:40:00  2007     2   44.90
2007-07-06 16:35:00  2007     2   16.42
2007-07-06 23:53:00  2007     2    1.73
2007-12-06 22:18:00  2007     1   80.00
2007-12-07 14:42:00  2007     1   21.52
2007-12-09 06:36:00  2007     1   17.40
2007-12-09 19:49:00  2007     1   62.18
2007-12-14 06:47:00  2007     1   15.26

In [241]:
(pdf
 .set_index("dt").sort_index() # must set index to datetime and sort it
 .assign(roll3d_sum = lambda x : x.rolling("3D")["amount"].sum())
 )

                     Year  User  amount  roll3d_sum
dt
2007-03-27 16:22:00  2007     0  110.43      110.43
2007-03-29 05:45:00  2007     0  117.62      228.05
2007-03-29 06:00:00  2007     0  114.56      342.61
2007-03-29 09:43:00  2007     0  176.53      519.14
2007-03-31 06:02:00  2007     0   33.10      441.81
2007-07-05 14:54:00  2007     2  118.64      118.64
2007-07-06 04:36:00  2007     2   35.59      154.23
2007-07-06 09:40:00  2007     2   44.90      199.13
2007-07-06 16:35:00  2007     2   16.42      215.55
2007-07-06 23:53:00  2007     2    1.73      217.28
2007-12-06 22:18:00  2007     1   80.00       80.00
2007-12-07 14:42:00  2007     1   21.52      101.52
2007-12-09 06:36:00  2007     1   17.40      118.92
2007-12-09 19:49:00  2007     1   62.18      181.10
2007-12-14 06:47:00  2007     1   15.26       15.26

### Dask
Dask need to `set_index` on datetime datatype (and convert to know division), then could do the rolling operation

In [187]:
sample_ddf.known_divisions

False

In [188]:
timed_idx_ddf = sample_ddf.set_index("dt", sort=True)

In [189]:
timed_idx_ddf.known_divisions

True

In [190]:
timed_idx_ddf.npartitions

55

In [191]:
timed_idx_ddf.divisions[:10]

(Timestamp('2007-03-27 16:22:00'),
 Timestamp('2007-03-28 02:13:20.181818112'),
 Timestamp('2007-03-28 12:04:40.363636480'),
 Timestamp('2007-03-28 21:56:00.545454592'),
 Timestamp('2007-03-29 05:45:24.545454592'),
 Timestamp('2007-03-29 05:47:23.181818112'),
 Timestamp('2007-03-29 05:49:21.818181888'),
 Timestamp('2007-03-29 05:51:20.454545408'),
 Timestamp('2007-03-29 05:53:19.090909184'),
 Timestamp('2007-03-29 05:55:17.727272704'))

In [38]:
(timed_idx_ddf
#  .sort_values(["User", "dt"], ascending=True)
 .assign(roll3_sum = lambda x : x["amount"].rolling(window = 2, min_periods=1).sum())
).compute()

                     Year  User  amount  roll3_sum
dt
2007-03-27 16:22:00  2007     0  110.43     110.43
2007-03-29 05:45:00  2007     0  117.62     228.05
2007-03-29 06:00:00  2007     0  114.56     232.18
2007-03-29 09:43:00  2007     0  176.53     291.09
2007-03-31 06:02:00  2007     0   33.10     209.63
2007-07-05 14:54:00  2007     2  118.64     151.74
2007-07-06 04:36:00  2007     2   35.59     154.23
2007-07-06 09:40:00  2007     2   44.90      80.49
2007-07-06 16:35:00  2007     2   16.42      61.32
2007-07-06 23:53:00  2007     2    1.73      18.15
2007-12-06 22:18:00  2007     1   80.00      81.73
2007-12-07 14:42:00  2007     1   21.52     101.52
2007-12-09 06:36:00  2007     1   17.40      38.92
2007-12-09 19:49:00  2007     1   62.18      79.58
2007-12-14 06:47:00  2007     1   15.26      77.44

Dask partition conflict when increase window size, partition size have to be big (or, npartition small)

In [20]:
timed_idx_ddf = timed_idx_ddf.repartition(npartitions=1)
(timed_idx_ddf
 .assign(roll3_sum = lambda x : x["amount"].rolling(window = 4, min_periods=1).sum())
).compute()

                     Year  User  amount  roll3_sum
dt
2007-03-27 16:22:00  2007     0  110.43     110.43
2007-03-29 05:45:00  2007     0  117.62     228.05
2007-03-29 06:00:00  2007     0  114.56     342.61
2007-03-29 09:43:00  2007     0  176.53     519.14
2007-03-31 06:02:00  2007     0   33.10     441.81
2007-07-05 14:54:00  2007     2  118.64     442.83
2007-07-06 04:36:00  2007     2   35.59     363.86
2007-07-06 09:40:00  2007     2   44.90     232.23
2007-07-06 16:35:00  2007     2   16.42     215.55
2007-07-06 23:53:00  2007     2    1.73      98.64
2007-12-06 22:18:00  2007     1   80.00     143.05
2007-12-07 14:42:00  2007     1   21.52     119.67
2007-12-09 06:36:00  2007     1   17.40     120.65
2007-12-09 19:49:00  2007     1   62.18     181.10
2007-12-14 06:47:00  2007     1   15.26     116.36

### Dask - time aware window aggregate

In [7]:
timed_idx_ddf = sample_ddf.set_index("dt", sort=True)

In [8]:
timed_idx_ddf["roll3d_sum"] = timed_idx_ddf["amount"].rolling("3D").sum()

In [9]:
timed_idx_ddf.compute()

                     Year  User  amount  roll3d_sum
dt
2007-03-27 16:22:00  2007     0  110.43      110.43
2007-03-29 05:45:00  2007     0  117.62      228.05
2007-03-29 06:00:00  2007     0  114.56      342.61
2007-03-29 09:43:00  2007     0  176.53      519.14
2007-03-31 06:02:00  2007     0   33.10      441.81
2007-07-05 14:54:00  2007     2  118.64      118.64
2007-07-06 04:36:00  2007     2   35.59      154.23
2007-07-06 09:40:00  2007     2   44.90      199.13
2007-07-06 16:35:00  2007     2   16.42      215.55
2007-07-06 23:53:00  2007     2    1.73      217.28
2007-12-06 22:18:00  2007     1   80.00       80.00
2007-12-07 14:42:00  2007     1   21.52      101.52
2007-12-09 06:36:00  2007     1   17.40      118.92
2007-12-09 19:49:00  2007     1   62.18      181.10
2007-12-14 06:47:00  2007     1   15.26       15.26

In [10]:
(sample_ddf
 .set_index("dt", sort=True)
 .assign(roll3d_sum = lambda x : x["amount"].rolling("3D").sum())
).compute()

                     Year  User  amount  roll3d_sum
dt
2007-03-27 16:22:00  2007     0  110.43      110.43
2007-03-29 05:45:00  2007     0  117.62      228.05
2007-03-29 06:00:00  2007     0  114.56      342.61
2007-03-29 09:43:00  2007     0  176.53      519.14
2007-03-31 06:02:00  2007     0   33.10      441.81
2007-07-05 14:54:00  2007     2  118.64      118.64
2007-07-06 04:36:00  2007     2   35.59      154.23
2007-07-06 09:40:00  2007     2   44.90      199.13
2007-07-06 16:35:00  2007     2   16.42      215.55
2007-07-06 23:53:00  2007     2    1.73      217.28
2007-12-06 22:18:00  2007     1   80.00       80.00
2007-12-07 14:42:00  2007     1   21.52      101.52
2007-12-09 06:36:00  2007     1   17.40      118.92
2007-12-09 19:49:00  2007     1   62.18      181.10
2007-12-14 06:47:00  2007     1   15.26       15.26

## Windows aggregate With Partition

**SQL equivalant**

```sql
select *
, sum(amount) over (partition by User order by dt asc 
                    rows between 2 preceding and current row) as rolling3_sum
from sample_ddf
```

### Pandas

In [242]:
# Pandas - result same as SQL
(pdf
 .sort_values(["User", "dt"], ascending=True)
 .assign(rolling3_sum_by_usr = lambda x : x.groupby(["User"])["amount"]
                                           .rolling(window=3, min_periods=1).sum()
                                           .reset_index(drop=True).values) # Reset & drop index, convert to numpy and attached back to data frame
)

   Year                  dt  User  amount  rolling3_sum_by_usr
4  2007 2007-03-27 16:22:00     0  110.43               110.43
3  2007 2007-03-29 05:45:00     0  117.62               228.05
2  2007 2007-03-29 06:00:00     0  114.56               342.61
1  2007 2007-03-29 09:43:00     0  176.53               408.71
0  2007 2007-03-31 06:02:00     0   33.10               324.19
4  2007 2007-12-06 22:18:00     1   80.00                80.00
3  2007 2007-12-07 14:42:00     1   21.52               101.52
2  2007 2007-12-09 06:36:00     1   17.40               118.92
1  2007 2007-12-09 19:49:00     1   62.18               101.10
0  2007 2007-12-14 06:47:00     1   15.26                94.84
4  2007 2007-07-05 14:54:00     2  118.64               118.64
3  2007 2007-07-06 04:36:00     2   35.59               154.23
2  2007 2007-07-06 09:40:00     2   44.90               199.13
1  2007 2007-07-06 16:35:00     2   16.42                96.91
0  2007 2007-07-06 23:53:00     2    1.73                63.05

### Dask - (Need further explore)
Could get the result as Dask Array , but could not combine back to original dataframe

In [54]:
# Dask , must rolling with known division
timed_idx_ddf = sample_ddf.set_index("dt", sort=True).repartition(npartitions=1)
idx = timed_idx_ddf.index

# timed_idx_ddf["rolling3_sum_by_usr"] = \
# arr = timed_idx_ddf.groupby("User")["amount"].rolling(window=3).sum().reset_index()[["amount"]].to_dask_array(lengths=True)
ser = timed_idx_ddf.groupby("User")["amount"].rolling(window=3).sum().reset_index(drop=True)
ser
new = dd.concat([timed_idx_ddf, ser], axis=1)
new.compute()
# arr = timed_idx_ddf.groupby("User")["amount"].rolling(window=3).sum().to_dask_array(lengths=True)
# arr.compute()
# ddf = arr.to_dask_dataframe(columns="rolling2_sum_by_usr", index=idx)
# ddf = arr.to_dask_dataframe()
# ddf.compute()
# arr.compute()
# timed_idx_ddf["olling3_sum_by_usr"] = arr.to_
# ddf = dd.from_array(arr)
# ddf

# arr.visualize()
# timed_idx_ddf["rolling3_sum_by_usr"] = arr.to_dask_array().reshape(-1,1)

# timed_idx_ddf.compute()
# type(arr.reset_index()["amount"])

# timed_idx_ddf["rolling3_sum_by_usr"] = \
# timed_idx_ddf.groupby("User")["amount"].rolling(window=3).sum().reset_index()["amount"]

# timed_idx_ddf.compute()
# arr.compute().shape
# arr.to_dask_dataframe().compute()
# arr_ddf = arr.to_dask_dataframe()
# arr_ddf.compute()
# timed_idx_ddf.compute()
# (timed_idx_ddf
#  .assign(rolling3_sum_by_usr = lambda x : x.groupby(["User"])["amount"].rolling(window=3).sum()
#         #  .reset_index(drop=True).values)
# )

TypeError: '<' not supported between instances of 'Timestamp' and 'NoneType'

SQL equivalant

```sql
select *
, sum(amount) over (partition by User order by dt asc 
                    rows between 2 preceding and current row) as rolling3_sum
from sample_ddf
```

Time awared rolling at monthly have issue on the cut point of each month end not equal (29, 30, 31)

In [237]:
sorted_ddf["rolling_mnth_sum"] = sorted_ddf["amount"].rolling("1M").sum()

ValueError: Can only rolling dataframes with known divisions
See https://docs.dask.org/en/latest/dataframe-design.html#partitions
for more information.